// მიიყვანეთ საბოლოო დონემდე სარეგისტრაციო ფორმის პროექტი. შეგახსენებთ, რომ სრულყოფილად უნდა გქონდეთ სტრუქტიურა + დიზაინი + ფუნქციონალი (ვალიდაციები)
// Main task: პროექტში ვალიდაციების დროს alert-ის მაგივრად მომხმარებელს დაუკმაყოფილებელი კრიტერიუმის შესახებ ინფორმაცია გამოუტანეთ შესაბამისი Input-ის ქვემოთ წითელი ფერის პარაგრაფით.

//  მაგ. თუ მომხმარებლის სახელი და გვარი 5 სიმბოლოს არ აღემატება -> Name input-ის ქვემოთ submit მოვლენის შემდეგ გამოიტანეთ ტექსტი 'Name & Surname should be at least 5 letters'.
// ასევე, თუ Password და Confirm Password ველები არ ემთხვევა ერთმანეთს - ორივე input-ის ქვემოთ გამოიტანთ 'Passwords do not match'. 
// გამოგადგებათ Event Listeners, textContent, DOM Manipulation...