#1. Multi-level Inheritance (მრავალდონიანი მემკვიდრეობა)
##ეს არის მემკვიდრეობა, როცა ერთი კლასი მემკვიდრეობით იღებს სხვა კლასის თვისებებს, 
# და ის სხვა კლასი თავის მხრივ ასევე მემკვიდრეობით იღებს მესამე კლასის თვისებებს. 
# ეს ისევეა, როგორც ჯაჭვური მემკვიდრეობა.


#2. Multiple Inheritance
#ეს არის მემკვიდრეობა, როდესაც ერთი კლასი მემკვიდრეობით იღებს რამდენიმე კლასის თვისებებს ერთდროულად.



# მოკლედ:
# Multi-level Inheritance: ერთი კლასი მემკვიდრეობით იღებს სხვა კლასისგან, და ის სხვა კლასიც თავის მხრივ სხვა კლასისგან.
# Multiple Inheritance: ერთი კლასი მემკვიდრეობით იღებს რამდენიმე კლასს ერთდროულად.