#SyntaxError – როდესაც კოდის სტრუქტურა არასწორია. (მაგ. გამოტოვებულია ფრჩხილი ან წერტილმძიმე)

#NameError – ცვლადი ან ფუნქცია გამოიყენება მანამ, სანამ არ გამოცხადდა.

#TypeError – ოპერაცია გამოყენებულია შეუთავსებელ მონაცემთა ტიპებზე. (მაგ. რიცხვი + ტექსტი)

#ValueError – ფუნქციას გადაეცემა სწორი ტიპის, მაგრამ მიუღებელი მნიშვნელობა.

#IndexError – სიიდან ან მასივიდან ელემენტის მოთხოვნა მიუწვდომელი ინდექსით.

#KeyError – ლექსიკონში არარსებული გასაღების გამოყენება.

#AttributeError – ობიექტზე არარსებული ატრიბუტის ან მეთოდის გამოძახება.