#code 1
first_user = "Lika"
second_user = "Giorgi"  # ცვლადის სახელი უნდა იწყებოდეს ასოთი
print(first_user)  # ცვლადის სახელი არ უნდა შეიცავდეს ცარიელ ადგილს

#code 2
first_name = "Data"        # ცვლადში არ შეიძლება იყოს ცარიელი ადგილი
last_name = "random"       # სიმბოლო "%" არ არის დასაშვები ცვლადის სახელში

#code 3
Num1 = 20
num2 = 30
print(Num1 + num2)  # შედეგი: 50

# Num1 არის 20, ხოლო num2 არის 30.
# მიუხედავად იმისა, რომ ცვლადების სახელებში ასოების განსხვავებულია, Python-ში ეს სხვადასხვა ცვლადია.
# მაგრამ ჩვენ ვიყენებთ Num1 და num2 – ამათემატიკურად ვახორციელებთ 20 + 30 = 50.
