#კარგი პრაქტიკების გამოყენება კოდის წერისას აუცილებელია იმიტომ, რომ:

#კოდი ხდება უფრო წაკითხვისა და გასაგები როგორც ავტორისთვის, ისე სხვებისთვის;

#ადვილია შეცდომების პოვნა და გასწორება (debugging);

#კოდის მხარდაჭერა და განახლება უფრო მარტივია;

#უფრო ეფექტიანად მუშაობს გუნდი, როცა ყველა ერთნაირ სტილზე მუშაობს;

#პროექტის ხარისხი და სტაბილურობა იზრდება.

#მაგალითები კარგი პრაქტიკებიდან:

#ცვლადებს გასაგები სახელების მიცემა;

#კომენტარების გამოყენება;

#კოდის დასუფთავება;

#ერთიანი სტილისტიკა 

