// map() - შექმნის ახალ მასივს, სადაც თითოეული ელემენტი იქნება ორიგინალი ელემენტის შედეგი ფუნქციის გამოყენების შემდეგ
// filter() - ფილტრავს ელემენტებს, რომლებიც აკმაყოფილებენ განსაზღვრულ პირობებს
// forEach() - ატარებს ფუნქციას თითოეული ელემენტისთვის, მაგრამ არ აბრუნებს ახალ მასივს
// findIndex() - აბრუნებს პირველ ელემენტის ინდექსს, რომელიც აკმაყოფილებს გარკვეულ პირობას



const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

const evenNumbers = numbers.filter(num => num % 2 === 0);


console.log(evenNumbers);  

console.log(numbers); 
