/*მეთოდები არის ფუნქციები, რომლებიც ეკუთვნის კონკრეტულ ობიექტს (მაგ: String, Math, Array).
მათ ვიყენებთ იმისთვის, რომ:

დავამუშაოთ მონაცემები (სტრინგები, რიცხვები და ა.შ.)
შევცვალოთ ტექსტის ფორმატი
შევამოწმოთ ტექსტის შინაარსი
შევასრუlოთ მათემატიკური ოპერაციები

დღეს ნასწავლი მეთოდები:

toUpperCase() – სტრინგს აქცევს დიდ ასოებად

toLowerCase() – სტრინგს აქცევს პატარა ასოებად

startsWith() – ამოწმებს იწყება თუ არა სტრინგი მითითებული ტექსტით

endsWith() – ამოწმებს მთავრდება თუ არა სტრინგი მითითებული ტექსტით

trim() – შლის ზედმეტ space-ებს სტრინგის დასაწყისში და ბოლოში

concat() – აერთიანებს სტრინგებს

Math.random() – აბრუნებს რენდომ რიცხვს

Math.floor() – ამრგვალებს რიცხვს ქვემოთ

Math.round() – ამრგვალებს მათემატიკური სტანდარტით*/