        #ტიპი	                                                 მარტივი ახსნა
#1. თანმიმდევრული (Sequential)	           ყველა ნაბიჯი ზედიზედ სრულდება, ერთის შემდეგ მეორე.
#2. პირობითი (Selection / If)	            რაღაც პირობას ამოწმებს და გადაწყვეტილებას იღებს. (მაგ: თუ ტემპერატურა > 30, ჩართე კონდიციონერი).
#3. ციკლური (Loop / Repeat)                 მოქმედება მეორდება რამდენჯერმე. (მაგ: 10-ჯერ დაბეჭდე "Hello").
#4. რეკურსია (Recursion)	                 ფუნქცია საკუთარ თავს იძახებს. (მაგ: მათემატიკური გამოთვლები, როგორიცაა ფაქტორიალი).
#5. ხარბი (Greedy)                           ყოველ ნაბიჯზე საუკეთესო არჩევანს აკეთებს. (მაგ: მონეტების გადაცვლა – აიღე რაც შეიძლება დიდი მონეტა).
#6. დაყო და მართე (Divide and Conquer)	    პრობლემას პატარა ნაწილებად ყოფს და ცალ–ცალკე აგვარებს. (მაგ: სწრაფი დალაგება – Quick Sort).