function stray(numbers) { // ვქმნით ფუნქციას რომელიც იღებს რიცხების მასივს
let common=0; // ვქმნით ცვლადს common და ვუტოლებთ 0

if(numbers[0]===numbers[1] || numbers[0]===numbers[2]){ // თუ პირველი რიცხვი ემთხვევა მეორეს ან მესამეს
    common=numbers[0] // მაშინ პირველი რიხვი არის საერთო მნიშვნელობა
} else{               // სხვა შემთხვევაში, 
    common=numbers[1] // საერთ მნიშვნელობა არის მეორე რიცხვი
}

for(let i=0; i<numbers.length; i++){ // გადავუვლით მასივს for loop ციკლის საშუალწბით
    if(numbers[i]!== common){ // თუ ელემენტი i არუდრის საერთო მნიშვნელობას 
    return number[i]          // დავაბრუნებთ ამ განსხვავებულ (ერთადერთ) რიცხვს
    } 
}
}

