// 1) მიიყვანეთ Todo-app edit ფუნქციონალამდე. (ჰქონდეს add, remove, edit). ასევე,
// remove-ის დროს შექმენით ანიმაცია, რომ ხაზი გადაესვას Task-ს და ისე წაიშალოს სიიდან. 
// (ვისაც ფუნქცონალი უკვე სრულყოფილად გაქვთ - იმუშავეთ დიზაინის გაუმჯობესებაზე.

// 2) დაასრულეთ პროექტი:
// შექმენით პროექტი Music App, უნდა შეგეძლოთ ახალი მუსიკის დამატება title, artist - ით, 
// (ამოიღეთ მოცემული მნიშვნელობები input - ებიდან), მუსიკის წაშლა, მუსიკის განახლებაც, 
// კოდი უნდა იყოს ორგანიზებული.

// ამ აპს ჰქონდეს Todo app-ისგან სრულიად განსხვავებული დიზაინი და ფუნქციონალი.
//  როდესაც მომხმარებელი Library-ში მუსიკას დაამატებს - მას ასევე უნდა შეეძლოს მისი ჩართვა/მოსმენა. (დაამატეთ Audio).

// 3) ასევე დაასრულეთ ეს პროექტი. შემდეგისთვის ყველას უნდა გქონდეთ ფუნქციონალი: