# მომხმარებელს შემოატანინეთ 5 რიცხვი
nums = []
for i in range(5):
    num = float(input(f"{i+1}-ე რიცხვი: "))
    nums.append(num)

average = sum(nums) / len(nums)
print("საშუალო არითმეტიკული:", average)
#-------------------------------------------------------------------
## თითო რიცხვს ვკითხავთ ცალ-ცალკე და ბოლოს გამოვთვლით საშუალოს
a = float(input("შეიყვანე პირველი რიცხვი: "))
b = float(input("შეიყვანე მეორე რიცხვი: "))
c = float(input("შეიყვანე მესამე რიცხვი: "))
d = float(input("შეიყვანე მეოთხე რიცხვი: "))
e = float(input("შეიყვანე მეხუთე რიცხვი: "))

# ვამატებთ და ვყოფთ 5-ზე
avg = (a + b + c + d + e) / 5

print("საშუალო არის:", avg)
