// 1) კომენტარების სახით დეტალურად ახსენით რა არის და რისთვის გამოიყენება 
// promise - ები (თავისი მდგომარეობებით, .then, .catch და .finally მეთოდებიც).


// 1) რა არის Promise ?


// Promise არის JavaScript-ის ობიექტი, რომელიც გამოიყენება
// ასინქრონული (დაგვიანებული) ოპერაციების სამართავად.
// მაგალითად:
// - ფაილის წაკითხვა
// - მონაცემთა ბაზასთან მუშაობა
// Promise გვპირდება, რომ მომავალში დაგვიბრუნებს შედეგს
// ან შეცდომას.

// =====================================================
// Promise-ის მდგომარეობები (States)

// 1. Pending
// საწყისი მდგომარეობა.
// ოპერაცია ჯერ არ დასრულებულა.

// 2. Fulfilled (Resolved)
// ოპერაცია წარმატებით დასრულდა.

// 3. Rejected
// ოპერაცია შეცდომით დასრულდა.


// Promise-ის შექმნის მაგალითი

const promise = new Promise((resolve, reject) => {
    const success = true;

    if (success) {
    resolve("ოპერაცია წარმატებით დასრულდა");
    } else {
    reject("დაფიქსირდა შეცდომა");
    }
});


// .then()
// =====================================================

// .then() მუშაობს მაშინ, როცა Promise წარმატებით სრულდება
// ანუ resolve() გამოიძახება.

promise.then((result) => {
    console.log(result);
});


// .catch()
// =====================================================

// .catch() მუშაობს მაშინ, როცა Promise შეცდომით სრულდება
// ანუ reject() გამოიძახება.

promise.catch((error) => {
    console.log(error);
});


// .finally()
// =====================================================

// .finally() ყოველთვის შესრულდება
// მნიშვნელობა არ აქვს Promise resolve გახდა თუ reject.
//
// ძირითადად გამოიყენება დასუფთავების ოპერაციებისთვის
// (მაგალითად loader-ის გამორთვა).

promise.finally(() => {
    console.log("ოპერაცია დასრულდა");
});

