// ვქმნით მასივს, რომელიც შეიცავს რიცხვებს 0-დან 4-მდე
let arr = [0, 1, 2, 3, 4];

// ცვლადი result ინახავს საბოლოო ჯამს
let result = 0;

// for ციკლი გადის მასივის ყველა ელემენტზე
// i იწყება 0-დან და იზრდება მანამ, სანამ arr.length-ზე ნაკლებია
for (let i = 0; i < arr.length; i++) {

  //ელემენტი ინახება ცვლადში val
    let val = arr[i];

  // პირველი პირობა:
  // val && (val & 2) === 0
  // val && — ამოწმებს არის თუ არა val "truthy" (0 false-ია)
  // val & 2 — ბიტური AND ოპერაცია
  // === 0 — ამოწმებს შედეგი 0 არის თუ არა
    if (val && (val & 2) === 0) {

    // თუ პირობა ჭეშმარიტია, result-ს ემატება val
    result += val;

    }
  // მეორე პირობა:
  // val === 0 — ამოწმებს, არის თუ არა მიმდინარე ელემენტი ნული
    else if (val === 0) {

    // ternary ოპერატორი:
    // val ? val : 10
    // რადგან val === 0 (false),
    // result-ს ემატება 10
    result += val ? val : 10;

    }
  // თუ არც ერთი პირობა არ შესრულდა
    else {

    // result-ს ემატება 100
    result += 100;

    }
}

// საბოლოო შედეგის გამოტანა კონსოლში
console.log(result);
